{
  "NorthWest": {
    "rainfallMm": 1300,
    "temperatureC": 10,
    "humidityPercent": 80,
    "rainfallScore": 75,
    "livestockDensity": 180,
    "livestockScore": 75,
    "prevalenceScore": 75,
    "baseRiskScore": 45,
    "riskExplained": "The North West has the highest risk of pasture parasite infection due to its high rainfall and livestock density. Farmers in this region should be particularly vigilant in monitoring their pastures and implementing effective parasite control measures."
  },
  "SouthWest": {
    "rainfallMm": 1250,
    "temperatureC": 10,
    "humidityPercent": 83,
    "rainfallScore": 75,
    "livestockDensity": 160,
    "livestockScore": 75,
    "prevalenceScore": 75,
    "baseRiskScore": 45,
    "riskExplained": "The South West also has a high risk of pasture parasite infection, with significant rainfall and livestock density. Farmers in this region should prioritize regular pasture monitoring and consider strategic deworming programs to manage parasite risks effectively."
  },
  "WestMidlands": {
    "rainfallMm": 800,
    "temperatureC": 10,
    "humidityPercent": 80,
    "rainfallScore": 50,
    "livestockDensity": 140,
    "livestockScore": 50,
    "prevalenceScore": 50,
    "baseRiskScore": 30,
    "riskExplained": "The West Midlands has a moderate risk of pasture parasite infection. While the rainfall and livestock density are not as high as in the North West and South West, farmers should still be proactive in monitoring their pastures and implementing parasite control measures to prevent outbreaks."
  },
  "Yorkshire": {
    "rainfallMm": 800,
    "temperatureC": 10,
    "humidityPercent": 80,
    "rainfallScore": 25,
    "livestockDensity": 120,
    "livestockScore": 50,
    "prevalenceScore": 38,
    "baseRiskScore": 21.9,
    "riskExplained": "Yorkshire has a lower risk of pasture parasite infection compared to the North West and South West, but it still requires attention. Farmers should maintain good pasture management practices and consider regular parasite monitoring to keep risks at bay."
  },
  "EastMidlands": {
    "rainfallMm": 700,
    "temperatureC": 10,
    "humidityPercent": 79,
    "rainfallScore": 50,
    "livestockDensity": 80,
    "livestockScore": 30,
    "prevalenceScore": 40,
    "baseRiskScore": 25,
    "riskExplained": "The East Midlands has a moderate risk of pasture parasite infection. With moderate rainfall and livestock density, farmers should focus on regular pasture inspections and consider strategic deworming to manage parasite risks effectively."
  },
  "EastAnglia": {
    "rainfallMm": 600,
    "temperatureC": 11,
    "humidityPercent": 80,
    "rainfallScore": 25,
    "livestockDensity": 45,
    "livestockScore": 15,
    "prevalenceScore": 20,
    "baseRiskScore": 12.6,
    "riskExplained": "East Anglia has a lower risk of pasture parasite infection due to its lower rainfall and livestock density. However, farmers should still practice good pasture management and monitor for parasites to prevent any potential outbreaks."
  },
  "SouthEast": {
    "rainfallMm": 550,
    "temperatureC": 11,
    "humidityPercent": 75,
    "rainfallScore": 50,
    "livestockDensity": 90,
    "livestockScore": 30,
    "prevalenceScore": 40,
    "baseRiskScore": 25,
    "riskExplained": "The South East has a moderate risk of pasture parasite infection. With moderate rainfall and livestock density, farmers should focus on regular pasture inspections and consider strategic deworming to manage parasite risks effectively."
  },

  "NorthEast": {
    "rainfallMm": 800,
    "temperatureC": 9,
    "humidityPercent": 82,
    "rainfallScore": 50,
    "livestockDensity": 100,
    "livestockScore": 50,
    "prevalenceScore": 50,
    "baseRiskScore": 30,
    "riskExplained": "The North East has a moderate risk of pasture parasite infection. With moderate rainfall and livestock density, farmers should focus on regular pasture inspections and consider strategic deworming to manage parasite risks effectively."
  }
}
